In [2]:
print('teste')

teste

In [3]:
import pandas as pd

In [11]:
df = pd.read_csv('salarios.csv')

In [8]:
df2 = pd.read_csv(('salarios.csv'), encoding='UTF-8', sep=',', header=0, usecols=['Name','Position Title'],nrows=10)

In [9]:
df2

                    Name            Position Title
0        AARON,  ELVIA J          WATER RATE TAKER
1      AARON,  JEFFERY M            POLICE OFFICER
2         AARON,  KARINA            POLICE OFFICER
3    AARON,  KIMBERLEI R  CHIEF CONTRACT EXPEDITER
4    ABAD JR,  VICENTE M         CIVIL ENGINEER IV
5        ABARCA,  ANABEL      ASST TO THE ALDERMAN
6      ABARCA,  EMMANUEL     GENERAL LABORER - DSS
7  ABBATACOLA,  ROBERT J       ELECTRICAL MECHANIC
8  ABBATEMARCO,  JAMES J             FIRE ENGINEER
9       ABBATE,  TERRY M            POLICE OFFICER

In [13]:
df.shape

(32182, 4)

In [14]:
df.head(10)

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$88968.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$80778.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$80778.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$84780.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$104736.00
5,"ABARCA, ANABEL",ASST TO THE ALDERMAN,CITY COUNCIL,$70764.00
6,"ABARCA, EMMANUEL",GENERAL LABORER - DSS,STREETS & SAN,$40560.00
7,"ABBATACOLA, ROBERT J",ELECTRICAL MECHANIC,AVIATION,$91520.00
8,"ABBATEMARCO, JAMES J",FIRE ENGINEER,FIRE,$90456.00
9,"ABBATE, TERRY M",POLICE OFFICER,POLICE,$86520.00

In [16]:
df['Department']

0             WATER MGMNT
1                  POLICE
2                  POLICE
3        GENERAL SERVICES
4             WATER MGMNT
               ...
32177              POLICE
32178              POLICE
32179              POLICE
32180                DoIT
32181                 NaN
Name: Department, Length: 32182, dtype: object

In [21]:
df['Name and Salary']= df['Name']+ ' '+df['Employee Anuual Salary']

KeyError: 'Employee Anuual Salary'

In [20]:
df

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$88968.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$80778.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$80778.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$84780.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$104736.00
...,...,...,...,...
32177,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,$86520.00
32178,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$83616.00
32179,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$86520.00
32180,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$110352.00
32181,NaN,NaN,NaN,NaN